app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to book_path(@book.id) #セーブできた時
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "あ"], ["body", "あああ"], ["created_at", "2023-02-04 12:01:23.529305"], ["updated_at", "2023-02-04 12:01:23.529305"]]
SELECT "books".* FROM "books"

  def destroy
    book = Book.find(params[:id])  # データ（レコード）を1件取得
    book.destroy  # データ（レコード）を削除
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 9]]